Thesaru-p/AirTrixx/firmware/audio_dock_esp32s3/audio_dock_esp32s3.ino
/*
 * AirTrixx Wireless Audio Dock ESP32-S3 Firmware
 * 
 * Flow:
 *  1. Boots, initializes custom I2C pins for 16x2 LCD, setups WiFi STA and ESP-NOW.
 *  2. Registers ANTENNA_MAC_PLACEHOLDER as a peer.
 *  3. Enters "Wait for Clap" mode continuously.
 *  4. Edge Impulse model captures and classifies audio.
 *  5. Once a single or double clap is detected, it uninstalls the 32-bit Edge Impulse I2S task.
 *  6. Initializes 32-bit audio recording at 16kHz for 3 seconds (96,044 bytes total).
 *  7. Sends MSG_AUDIODOCK_DATA packet to Antenna with clap trigger type and audio_size.
 *  8. Saves WAV data into internal RAM.
 *  9. Uninstalls recording I2S driver.
 *  10. Slices the WAV buffer into 200-byte chunks and sends them over ESP-NOW using MSG_AUDIODOCK_AUDIO_CHUNK.
 *  11. Enters "Waiting for Transcript" state, listening for MSG_AUDIODOCK_TRANSCRIPT over ESP-NOW.
 *  12. When transcript is received, renders it beautifully on the 16x2 LCD.
 *  13. Returns to "Wait for Clap" mode.
 */

#define EIDSP_QUANTIZE_FILTERBANK   0
#include <ESP32-S3-Clap-Sensor_inferencing.h>
#include <driver/i2s.h>
#include <SPI.h>
#include <SD.h>
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <Adafruit_NeoPixel.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <esp_heap_caps.h>
#include <math.h>
#include <stdlib.h>

#if __has_include("../shared/AirTrixxConfig.h")
#include "../shared/AirTrixxConfig.h"
#include "../shared/AirTrixxProtocol.h"
#else
#include "AirTrixxConfig.h"
#include "AirTrixxProtocol.h"
#endif

// Match hardware wiring
#define I2S_WS 7
#define I2S_SD 17
#define I2S_SCK 4
#define I2S_PORT I2S_NUM_0

#define SAMPLE_RATE 16000
#define RECORD_SECONDS 3
#define RECORD_GAIN 32
#define SPEAK_DELAY_MS 900
#define CLAP_INFERENCE_GAIN 16
#define CLAP_LABEL_THRESHOLD 0.20f
#define CLAP_COMBINED_THRESHOLD 0.20f
#define CLAP_NOISE_MARGIN 0.00f
#define PRINT_CLAP_SCORES true
#define WAV_HEADER_BYTES 44
#define AUDIO_DATA_BYTES (RECORD_SECONDS * SAMPLE_RATE * sizeof(int16_t))
#define AUDIO_TOTAL_BYTES (WAV_HEADER_BYTES + AUDIO_DATA_BYTES)
static const int8_t WIFI_TX_POWER_QDBM = 34;  // 8.5 dBm in 0.25 dBm units.

// -------------------- SD card pins --------------------
#define SD_CS_PIN 47
#define SD_SCK_PIN 38
#define SD_MISO_PIN 40
#define SD_MOSI_PIN 39
#define SD_SPI_HZ 4000000
static const char *AUDIO_WAV_PATH = "/AIRDCK.WAV";

// -------------------- MAX98357A I2S speaker --------------------
#define SPEAKER_BCLK_PIN 21
#define SPEAKER_LRC_PIN 48
#define SPEAKER_DIN_PIN 1
#define SPEAKER_I2S_PORT I2S_NUM_1
#define SPEAKER_SAMPLE_RATE 22050
#define SPEAKER_VOLUME 20000

// -------------------- LCD Setup --------------------
#define I2C_SDA 41
#define I2C_SCL 42
LiquidCrystal_I2C lcd(0x27, 16, 2);

// -------------------- WS2812 LED ring --------------------
#define LED_RING_PIN 15
#define LED_RING_COUNT 16
#define LED_RING_BRIGHTNESS 32
Adafruit_NeoPixel ledRing(LED_RING_COUNT, LED_RING_PIN, NEO_GRB + NEO_KHZ800);
static const uint8_t AUDIO_DOCK_RING_SEGMENTS = 8;
static const uint8_t AUDIO_DOCK_COMPONENT_SEGMENTS = 6;
static const uint8_t AUDIO_DOCK_LEDS_PER_SEGMENT = LED_RING_COUNT / AUDIO_DOCK_RING_SEGMENTS;
static const uint32_t AUDIO_DOCK_HEARTBEAT_MS = 2000;
static const uint32_t AUDIO_DOCK_RING_REFRESH_MS = 100;

bool i2sReady = false;
bool speakerReady = false;
bool sdReady = false;
uint8_t *audioBuffer = nullptr;
uint16_t audioDockSequence = 0;
uint8_t pendingTriggerType = 0;
uint32_t recordedWavBytes = 0;
String lastRecordError = "";
static uint8_t antennaConnectionMask = 0;
static bool hasAntennaConnectionMask = false;
static uint32_t lastConnectionRingRefreshMs = 0;
static uint32_t lastAudioDockHeartbeatMs = 0;

// -------------------- Edge Impulse Inferencing Variables --------------------
typedef struct {
    int16_t *buffer;
    uint8_t buf_ready;
    uint32_t buf_count;
    uint32_t n_samples;
} inference_t;

static inference_t inference;
static const uint32_t sample_buffer_size = 2048;
static const uint8_t ESPNOW_BROADCAST_MAC[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
static int16_t sampleBuffer[sample_buffer_size];
static int32_t inferenceRawBuffer[sample_buffer_size];
static uint32_t inferenceWindowPeak = 0;
static volatile uint32_t lastInferencePeak = 0;
static bool debug_nn = false;
static bool record_status = true;
static volatile bool taskRunning = false;

void displayLCDStatus(const String &line1, const String &line2);
void displayLCDTranscript(const String &transcript);
void ringChase(uint8_t r, uint8_t g, uint8_t b, uint16_t head);
void ringProgress(uint32_t current, uint32_t total, uint8_t r, uint8_t g, uint8_t b);
void ringFlash(uint8_t r, uint8_t g, uint8_t b, uint8_t flashes, uint16_t onMs, uint16_t offMs);
void ringShowConnectionMask(uint8_t mask);
void ringShowReady();
void ringShowSuccess();
void ringShowError();
void runLedRingSelfTest();
void disableOnboardLed();
void playTranscriptionDoneSound();
void runSpeakerSelfTest();
void pumpAudioDockHeartbeat();

// State machine states
enum AudioDockState {
  STATE_INIT,
  STATE_WAIT_CLAP,
  STATE_RECORDING,
  STATE_STREAMING,
  STATE_WAIT_TRANSCRIPT
};
static AudioDockState currentState = STATE_INIT;
static String lastTranscriptText = "";
static String lastRemoteCommandText = "";
static uint32_t lastRemoteCommandMs = 0;
static bool transcriptReceived = false;
static uint32_t transcriptWaitStartMs = 0;
static const uint32_t TRANSCRIPT_TIMEOUT_MS = 30000;

// -------------------- LED Ring Helper Functions --------------------
void ringClear() {
  ledRing.clear();
  ledRing.show();
}

void ringFill(uint8_t r, uint8_t g, uint8_t b) {
  ledRing.fill(ledRing.Color(r, g, b));
  ledRing.show();
}

void ringSetScaledPixel(uint16_t pixel, uint8_t r, uint8_t g, uint8_t b, uint8_t scale) {
  ledRing.setPixelColor(pixel,
                        ((uint16_t)r * scale) / 255,
                        ((uint16_t)g * scale) / 255,
                        ((uint16_t)b * scale) / 255);
}

void ringChase(uint8_t r, uint8_t g, uint8_t b, uint16_t head) {
  ledRing.clear();
  for (uint8_t tail = 0; tail < 4; tail++) {
    uint16_t pixel = (head + LED_RING_COUNT - tail) % LED_RING_COUNT;
    uint8_t scale = 255 / (tail + 1);
    ringSetScaledPixel(pixel, r, g, b, scale);
  }
  ledRing.show();
}

