Thesaru-p/AirTrixx/firmware/audio_dock_esp32s3/audio_dock_esp32s3.ino
void ringProgress(uint32_t current, uint32_t total, uint8_t r, uint8_t g, uint8_t b) {
  uint16_t litPixels = 0;
  if (total > 0) {
    litPixels = (uint16_t)(((uint64_t)current * LED_RING_COUNT + total - 1) / total);
  }
  if (litPixels > LED_RING_COUNT) {
    litPixels = LED_RING_COUNT;
  }

  ledRing.clear();
  for (uint16_t i = 0; i < litPixels; i++) {
    ledRing.setPixelColor(i, ledRing.Color(r, g, b));
  }
  ledRing.show();
}

void ringFlash(uint8_t r, uint8_t g, uint8_t b, uint8_t flashes, uint16_t onMs, uint16_t offMs) {
  for (uint8_t i = 0; i < flashes; i++) {
    ringFill(r, g, b);
    delay(onMs);
    ringClear();
    delay(offMs);
  }
}

void ringShowConnectionMask(uint8_t mask) {
  ledRing.clear();

  for (uint8_t segment = 0; segment < AUDIO_DOCK_COMPONENT_SEGMENTS; segment++) {
    if ((mask & (1 << segment)) == 0) {
      continue;
    }

    uint16_t firstPixel = segment * AUDIO_DOCK_LEDS_PER_SEGMENT;
    for (uint8_t offset = 0; offset < AUDIO_DOCK_LEDS_PER_SEGMENT; offset++) {
      uint16_t pixel = firstPixel + offset;
      if (pixel < LED_RING_COUNT) {
        ledRing.setPixelColor(pixel, ledRing.Color(0, 48, 0));
      }
    }
  }

  ledRing.show();
}

void ringShowReady() {
  if (hasAntennaConnectionMask) {
    ringShowConnectionMask(antennaConnectionMask);
    return;
  }
  ringFill(0, 0, 24);
}

void ringShowSuccess() {
  ringFill(0, 48, 0);
}

void ringShowError() {
  ringFill(64, 0, 0);
}

void runLedRingSelfTest() {
  Serial.printf("LED_RING_TEST_BEGIN pin=%u count=%u\n", LED_RING_PIN, LED_RING_COUNT);
  displayLCDStatus("LED Ring Test", "GPIO 15");

  ringFlash(64, 0, 0, 1, 250, 100);
  ringFlash(0, 64, 0, 1, 250, 100);
  ringFlash(0, 0, 64, 1, 250, 100);

  for (uint8_t i = 0; i < LED_RING_COUNT; i++) {
    ledRing.clear();
    ledRing.setPixelColor(i, ledRing.Color(48, 48, 48));
    ledRing.show();
    delay(70);
  }

  ringShowReady();
  displayLCDStatus("LED Ring Test", "Done");
  Serial.println("LED_RING_TEST_DONE");
}

void disableOnboardLed() {
#if defined(RGB_BUILTIN)
  neopixelWrite(RGB_BUILTIN, 0, 0, 0);
  pinMode(RGB_BUILTIN, OUTPUT);
  digitalWrite(RGB_BUILTIN, LOW);
#elif defined(LED_BUILTIN)
  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW);
#endif
}

// -------------------- MAX98357A Speaker Helper Functions --------------------
bool initSpeakerI2S() {
  if (speakerReady) {
    return true;
  }

  i2s_config_t i2sConfig = {
    .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX),
    .sample_rate = SPEAKER_SAMPLE_RATE,
    .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
    .channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT,
    .communication_format = I2S_COMM_FORMAT_STAND_I2S,
    .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
    .dma_buf_count = 8,
    .dma_buf_len = 256,
    .use_apll = false,
    .tx_desc_auto_clear = true,
    .fixed_mclk = 0
  };

  i2s_pin_config_t pinConfig = {
    .bck_io_num = SPEAKER_BCLK_PIN,
    .ws_io_num = SPEAKER_LRC_PIN,
    .data_out_num = SPEAKER_DIN_PIN,
    .data_in_num = I2S_PIN_NO_CHANGE
  };

  esp_err_t err = i2s_driver_install(SPEAKER_I2S_PORT, &i2sConfig, 0, NULL);
  if (err != ESP_OK) {
    Serial.printf("Speaker I2S driver install failed: %d\n", err);
    return false;
  }

  err = i2s_set_pin(SPEAKER_I2S_PORT, &pinConfig);
  if (err != ESP_OK) {
    Serial.printf("Speaker I2S pin setup failed: %d\n", err);
    i2s_driver_uninstall(SPEAKER_I2S_PORT);
    return false;
  }

  i2s_zero_dma_buffer(SPEAKER_I2S_PORT);
  speakerReady = true;
  Serial.printf("Speaker ready: BCLK=%u LRC=%u DIN=%u\n",
                SPEAKER_BCLK_PIN,
                SPEAKER_LRC_PIN,
                SPEAKER_DIN_PIN);
  return true;
}

void deinitSpeakerI2S() {
  if (!speakerReady) {
    disableOnboardLed();
    return;
  }

  i2s_zero_dma_buffer(SPEAKER_I2S_PORT);
  i2s_driver_uninstall(SPEAKER_I2S_PORT);
  speakerReady = false;
  disableOnboardLed();
}

void playSpeakerSilence(uint16_t durationMs) {
  if (!speakerReady && !initSpeakerI2S()) {
    return;
  }

  const uint16_t framesPerBuffer = 128;
  int16_t samples[framesPerBuffer * 2] = {0};
  uint32_t totalFrames = ((uint32_t)SPEAKER_SAMPLE_RATE * durationMs) / 1000;

  while (totalFrames > 0) {
    uint32_t framesThis = totalFrames > framesPerBuffer ? framesPerBuffer : totalFrames;
    size_t bytesWritten = 0;
    i2s_write(SPEAKER_I2S_PORT,
              samples,
              framesThis * 2 * sizeof(int16_t),
              &bytesWritten,
              portMAX_DELAY);
    totalFrames -= framesThis;
  }
}

void playSpeakerTone(uint16_t frequency, uint16_t durationMs) {
  if (!speakerReady && !initSpeakerI2S()) {
    return;
  }

  const float twoPi = 6.28318530718f;
  const uint16_t framesPerBuffer = 128;
  int16_t samples[framesPerBuffer * 2];
  uint32_t totalFrames = ((uint32_t)SPEAKER_SAMPLE_RATE * durationMs) / 1000;
  float phase = 0.0f;
  float phaseStep = twoPi * (float)frequency / (float)SPEAKER_SAMPLE_RATE;

  while (totalFrames > 0) {
    uint32_t framesThis = totalFrames > framesPerBuffer ? framesPerBuffer : totalFrames;

    for (uint32_t i = 0; i < framesThis; i++) {
      int16_t sample = (int16_t)(sinf(phase) * SPEAKER_VOLUME);
      samples[(i * 2) + 0] = sample;
      samples[(i * 2) + 1] = sample;
      phase += phaseStep;
      if (phase >= twoPi) {
        phase -= twoPi;
      }
    }

    size_t bytesWritten = 0;
    i2s_write(SPEAKER_I2S_PORT,
              samples,
              framesThis * 2 * sizeof(int16_t),
              &bytesWritten,
              portMAX_DELAY);
    totalFrames -= framesThis;
  }
}

void playTranscriptionDoneSound() {
  playSpeakerTone(880, 120);
  playSpeakerSilence(50);
  playSpeakerTone(1175, 180);
  playSpeakerSilence(30);
  deinitSpeakerI2S();
}

void runSpeakerSelfTest() {
  Serial.printf("SPEAKER_TEST_BEGIN BCLK=%u LRC=%u DIN=%u\n",
                SPEAKER_BCLK_PIN,
                SPEAKER_LRC_PIN,
                SPEAKER_DIN_PIN);
  displayLCDStatus("Speaker Test", "MAX98357A");
  playTranscriptionDoneSound();
  displayLCDStatus("Speaker Test", "Done");
  Serial.println("SPEAKER_TEST_DONE");
}

