Thesaru-p/AirTrixx/firmware/audio_dock_esp32s3/audio_dock_esp32s3.ino
// -------------------- WAV Header & Recording Helper Functions --------------------
void writeLE16(uint8_t *buffer, size_t offset, uint16_t value) {
  buffer[offset] = (uint8_t)(value & 0xFF);
  buffer[offset + 1] = (uint8_t)((value >> 8) & 0xFF);
}

void writeLE32(uint8_t *buffer, size_t offset, uint32_t value) {
  buffer[offset] = (uint8_t)(value & 0xFF);
  buffer[offset + 1] = (uint8_t)((value >> 8) & 0xFF);
  buffer[offset + 2] = (uint8_t)((value >> 16) & 0xFF);
  buffer[offset + 3] = (uint8_t)((value >> 24) & 0xFF);
}

void writeWavHeader(uint8_t *buffer, uint32_t dataBytes) {
  const uint16_t channels = 1;
  const uint16_t bitsPerSample = 16;
  const uint32_t byteRate = SAMPLE_RATE * channels * (bitsPerSample / 8);
  const uint16_t blockAlign = channels * (bitsPerSample / 8);

  memcpy(buffer + 0, "RIFF", 4);
  writeLE32(buffer, 4, dataBytes + 36);
  memcpy(buffer + 8, "WAVE", 4);
  memcpy(buffer + 12, "fmt ", 4);
  writeLE32(buffer, 16, 16);
  writeLE16(buffer, 20, 1);
  writeLE16(buffer, 22, channels);
  writeLE32(buffer, 24, SAMPLE_RATE);
  writeLE32(buffer, 28, byteRate);
  writeLE16(buffer, 32, blockAlign);
  writeLE16(buffer, 34, bitsPerSample);
  memcpy(buffer + 36, "data", 4);
  writeLE32(buffer, 40, dataBytes);
}

void flushI2S() {
  int32_t discard[256];
  size_t bytesRead = 0;
  for (int i = 0; i < 6; i++) {
    i2s_read(I2S_PORT, discard, sizeof(discard), &bytesRead, 20 / portTICK_PERIOD_MS);
  }
}

bool initI2SMic() {
  i2s_config_t i2sConfig = {
    .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX),
    .sample_rate = SAMPLE_RATE,
    .bits_per_sample = I2S_BITS_PER_SAMPLE_32BIT,
    .channel_format = I2S_CHANNEL_FMT_ONLY_RIGHT,
    .communication_format = I2S_COMM_FORMAT_STAND_I2S,
    .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
    .dma_buf_count = 8,
    .dma_buf_len = 512,
    .use_apll = false,
    .tx_desc_auto_clear = false,
    .fixed_mclk = 0
  };

  i2s_pin_config_t pinConfig = {
    .bck_io_num = I2S_SCK,
    .ws_io_num = I2S_WS,
    .data_out_num = I2S_PIN_NO_CHANGE,
    .data_in_num = I2S_SD
  };

  esp_err_t err = i2s_driver_install(I2S_PORT, &i2sConfig, 0, NULL);
  if (err != ESP_OK) {
    return false;
  }

  err = i2s_set_pin(I2S_PORT, &pinConfig);
  if (err != ESP_OK) {
    return false;
  }

  i2s_zero_dma_buffer(I2S_PORT);
  i2sReady = true;
  return true;
}

bool allocateAudioBuffer() {
  if (audioBuffer != nullptr) {
    return true;
  }

  Serial.printf("Audio RAM request: %u bytes, free=%u, largest=%u\n",
                (unsigned int)AUDIO_TOTAL_BYTES,
                (unsigned int)heap_caps_get_free_size(MALLOC_CAP_8BIT),
                (unsigned int)heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));

  audioBuffer = (uint8_t *)heap_caps_malloc(AUDIO_TOTAL_BYTES, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
  if (audioBuffer == nullptr) {
    audioBuffer = (uint8_t *)heap_caps_malloc(AUDIO_TOTAL_BYTES, MALLOC_CAP_8BIT);
  }

  if (audioBuffer == nullptr) {
    lastRecordError = "RAM alloc failed";
    Serial.printf("Audio RAM allocation failed: need=%u free=%u largest=%u\n",
                  (unsigned int)AUDIO_TOTAL_BYTES,
                  (unsigned int)heap_caps_get_free_size(MALLOC_CAP_8BIT),
                  (unsigned int)heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));
    return false;
  }
  Serial.printf("Audio RAM ready: %u bytes\n", (unsigned int)AUDIO_TOTAL_BYTES);
  return (audioBuffer != nullptr);
}

bool initSDCard() {
  if (sdReady) {
    SD.end();
    SPI.end();
    sdReady = false;
    delay(20);
  }

  pinMode(SD_CS_PIN, OUTPUT);
  digitalWrite(SD_CS_PIN, HIGH);
  delay(10);
  SPI.begin(SD_SCK_PIN, SD_MISO_PIN, SD_MOSI_PIN, SD_CS_PIN);
  Serial.printf("SD init begin: CS=%u SCK=%u MISO=%u MOSI=%u hz=%u\n",
                SD_CS_PIN,
                SD_SCK_PIN,
                SD_MISO_PIN,
                SD_MOSI_PIN,
                SD_SPI_HZ);

  if (!SD.begin(SD_CS_PIN, SPI, SD_SPI_HZ)) {
    Serial.println("SD init failed. Check CS/SCK/MISO/MOSI pins and card format.");
    sdReady = false;
    return false;
  }

  uint8_t cardType = SD.cardType();
  if (cardType == CARD_NONE) {
    Serial.println("No SD card detected.");
    sdReady = false;
    return false;
  }

  Serial.print("SD card ready. Type: ");
  if (cardType == CARD_MMC) Serial.println("MMC");
  else if (cardType == CARD_SD) Serial.println("SDSC");
  else if (cardType == CARD_SDHC) Serial.println("SDHC/SDXC");
  else Serial.println("Unknown");

  sdReady = true;
  return true;
}

bool recordWavToMemory(uint32_t *wavBytes) {
  lastRecordError = "";
  if (!i2sReady) {
    lastRecordError = "I2S not ready";
    Serial.println("Cannot record: I2S mic is not ready.");
    return false;
  }

  if (!allocateAudioBuffer()) {
    return false;
  }

  writeWavHeader(audioBuffer, AUDIO_DATA_BYTES);
  flushI2S();

  Serial.printf("RECORDING_START seconds=%u\n", (unsigned int)RECORD_SECONDS);
  uint32_t startedAt = millis();
  uint32_t samplesWritten = 0;
  const uint32_t totalSamples = RECORD_SECONDS * SAMPLE_RATE;
  uint32_t lastRingUpdate = 0;
  int32_t i2sBuffer[512];
  int16_t pcmBuffer[512];
  ringProgress(0, totalSamples, 80, 24, 0);

  while (samplesWritten < totalSamples) {
    uint32_t samplesToRead = totalSamples - samplesWritten;
    if (samplesToRead > 512) samplesToRead = 512;

    size_t bytesRead = 0;
    esp_err_t err = i2s_read(I2S_PORT, i2sBuffer, samplesToRead * sizeof(int32_t), &bytesRead, portMAX_DELAY);
    if (err != ESP_OK || bytesRead == 0) {
      lastRecordError = "I2S read failed";
      Serial.printf("I2S recording read failed: err=%d bytes=%u at_sample=%u\n",
                    err,
                    (unsigned int)bytesRead,
                    (unsigned int)samplesWritten);
      return false;
    }

    size_t samples = bytesRead / sizeof(int32_t);
    for (size_t i = 0; i < samples; i++) {
      int32_t sample16 = i2sBuffer[i] >> 16;
      int32_t boosted = sample16 * RECORD_GAIN;
      if (boosted > 32767) boosted = 32767;
      if (boosted < -32768) boosted = -32768;
      pcmBuffer[i] = (int16_t)boosted;
    }

