Thesaru-p/AirTrixx/firmware/audio_dock_esp32s3/audio_dock_esp32s3.ino
    memcpy(audioBuffer + WAV_HEADER_BYTES + (samplesWritten * sizeof(int16_t)),
           pcmBuffer,
           samples * sizeof(int16_t));
    samplesWritten += samples;

    if (millis() - lastRingUpdate >= 120 || samplesWritten >= totalSamples) {
      ringProgress(samplesWritten, totalSamples, 80, 24, 0);
      lastRingUpdate = millis();
    }
  }

  uint32_t dataBytes = samplesWritten * sizeof(int16_t);
  writeWavHeader(audioBuffer, dataBytes);
  *wavBytes = dataBytes + WAV_HEADER_BYTES;
  Serial.printf("RECORDING_DONE ms=%lu wav_bytes=%u\n",
                (unsigned long)(millis() - startedAt),
                (unsigned int)*wavBytes);
  return true;
}

bool recordWavToSD(uint32_t *wavBytes) {
  lastRecordError = "";
  if (!initSDCard()) {
    lastRecordError = "SD not ready";
    return false;
  }
  if (!i2sReady) {
    lastRecordError = "I2S not ready";
    Serial.println("Cannot record: I2S mic is not ready.");
    return false;
  }

  if (SD.exists(AUDIO_WAV_PATH)) {
    SD.remove(AUDIO_WAV_PATH);
  }

  File file = SD.open(AUDIO_WAV_PATH, FILE_WRITE);
  if (!file) {
    lastRecordError = "SD open failed";
    Serial.println("Failed to open SD WAV file for writing.");
    return false;
  }

  uint8_t header[WAV_HEADER_BYTES];
  writeWavHeader(header, AUDIO_DATA_BYTES);
  if (file.write(header, WAV_HEADER_BYTES) != WAV_HEADER_BYTES) {
    lastRecordError = "SD write failed";
    Serial.println("Failed to write WAV header to SD.");
    file.close();
    return false;
  }

  displayLCDStatus("Get ready", "Recording soon");
  ringFlash(0, 64, 0, 2, 120, 80);
  delay(SPEAK_DELAY_MS);

  flushI2S();
  displayLCDStatus("Recording...", "Speak now!");
  Serial.printf("SD_RECORD_START seconds=%u path=%s\n",
                (unsigned int)RECORD_SECONDS,
                AUDIO_WAV_PATH);

  uint32_t startedAt = millis();
  uint32_t samplesWritten = 0;
  const uint32_t totalSamples = RECORD_SECONDS * SAMPLE_RATE;
  uint32_t lastRingUpdate = 0;
  int32_t i2sBuffer[512];
  int16_t pcmBuffer[512];
  ringProgress(0, totalSamples, 80, 24, 0);

  while (samplesWritten < totalSamples) {
    uint32_t samplesToRead = totalSamples - samplesWritten;
    if (samplesToRead > 512) samplesToRead = 512;

    size_t bytesRead = 0;
    esp_err_t err = i2s_read(I2S_PORT,
                             i2sBuffer,
                             samplesToRead * sizeof(int32_t),
                             &bytesRead,
                             portMAX_DELAY);
    if (err != ESP_OK || bytesRead == 0) {
      lastRecordError = "I2S read failed";
      Serial.printf("I2S SD record read failed: err=%d bytes=%u at_sample=%u\n",
                    err,
                    (unsigned int)bytesRead,
                    (unsigned int)samplesWritten);
      file.close();
      return false;
    }

    size_t samples = bytesRead / sizeof(int32_t);
    for (size_t i = 0; i < samples; i++) {
      int32_t sample16 = i2sBuffer[i] >> 16;
      int32_t boosted = sample16 * RECORD_GAIN;
      if (boosted > 32767) boosted = 32767;
      if (boosted < -32768) boosted = -32768;
      pcmBuffer[i] = (int16_t)boosted;
    }

    size_t pcmBytes = samples * sizeof(int16_t);
    if (file.write(reinterpret_cast<const uint8_t *>(pcmBuffer), pcmBytes) != pcmBytes) {
      lastRecordError = "SD write failed";
      Serial.println("Failed while writing PCM data to SD.");
      file.close();
      return false;
    }

    samplesWritten += samples;
    if (millis() - lastRingUpdate >= 120 || samplesWritten >= totalSamples) {
      ringProgress(samplesWritten, totalSamples, 80, 24, 0);
      lastRingUpdate = millis();
    }
  }

  uint32_t dataBytes = samplesWritten * sizeof(int16_t);
  writeWavHeader(header, dataBytes);
  file.seek(0);
  file.write(header, WAV_HEADER_BYTES);
  file.close();

  *wavBytes = dataBytes + WAV_HEADER_BYTES;
  Serial.printf("SD_RECORD_DONE ms=%lu wav_bytes=%u path=%s\n",
                (unsigned long)(millis() - startedAt),
                (unsigned int)*wavBytes,
                AUDIO_WAV_PATH);
  return true;
}

// -------------------- LCD UI Display Helper Functions --------------------
void displayLCDStatus(const String &line1, const String &line2) {
  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print(line1);
  lcd.setCursor(0, 1);
  lcd.print(line2);
}

void displayLCDTranscript(const String &transcript) {
  lcd.clear();
  String clean = transcript;
  clean.trim();
  if (clean.length() == 0) {
    lcd.setCursor(0, 0);
    lcd.print("Transcript:");
    lcd.setCursor(0, 1);
    lcd.print("(empty)");
    return;
  }

  if (clean.length() <= 16) {
    lcd.setCursor(0, 0);
    lcd.print("Transcript:");
    lcd.setCursor(0, 1);
    lcd.print(clean);
  } else {
    lcd.setCursor(0, 0);
    lcd.print(clean.substring(0, min((int)clean.length(), 16)));
    lcd.setCursor(0, 1);
    lcd.print(clean.substring(16, min((int)clean.length(), 32)));
  }
}

// -------------------- Edge Impulse Classifier Helper Functions --------------------
static void audio_inference_callback(uint32_t samplesRead) {
  for (uint32_t i = 0; i < samplesRead; i++) {
    int32_t value = sampleBuffer[i];
    uint32_t magnitude = value < 0 ? (uint32_t)(-value) : (uint32_t)value;
    if (magnitude > inferenceWindowPeak) {
      inferenceWindowPeak = magnitude;
    }

    inference.buffer[inference.buf_count++] = sampleBuffer[i];

    if (inference.buf_count >= inference.n_samples) {
      lastInferencePeak = inferenceWindowPeak;
      inferenceWindowPeak = 0;
      inference.buf_count = 0;
      inference.buf_ready = 1;
      break;
    }
  }
}

static void capture_samples(void* arg) {
  taskRunning = true;
  const uint32_t samplesToRead = (uint32_t)arg;

  while (record_status) {
    size_t bytes_read = 0;
    esp_err_t err = i2s_read(I2S_PORT,
                             (void*)inferenceRawBuffer,
                             samplesToRead * sizeof(int32_t),
                             &bytes_read,
                             100 / portTICK_PERIOD_MS);

    if (err != ESP_OK || bytes_read <= 0) {
      delay(10);
    } else {
      uint32_t samplesRead = bytes_read / sizeof(int32_t);
      if (samplesRead > sample_buffer_size) {
        samplesRead = sample_buffer_size;
      }

      for (uint32_t x = 0; x < samplesRead; x++) {
        int32_t sample16 = inferenceRawBuffer[x] >> 16;
        int32_t boosted = sample16 * CLAP_INFERENCE_GAIN;
        if (boosted > 32767) boosted = 32767;
        if (boosted < -32768) boosted = -32768;
        sampleBuffer[x] = (int16_t)boosted;
      }

      if (record_status && inference.buf_ready == 0) {
        audio_inference_callback(samplesRead);
      } else {
        break;
      }
    }
  }
  taskRunning = false;
  vTaskDelete(NULL);
}

static int ei_i2s_init(uint32_t sampling_rate) {
  i2s_config_t i2s_config = {
    .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX),
    .sample_rate = sampling_rate,
    .bits_per_sample = I2S_BITS_PER_SAMPLE_32BIT,
    .channel_format = I2S_CHANNEL_FMT_ONLY_RIGHT,
    .communication_format = I2S_COMM_FORMAT_STAND_I2S,
      .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
      .dma_buf_count = 8,
      .dma_buf_len = 512,
      .use_apll = false,
      .tx_desc_auto_clear = false,
      .fixed_mclk = 0
  };
  
  i2s_pin_config_t pin_config = {
      .bck_io_num = I2S_SCK,
      .ws_io_num = I2S_WS,
      .data_out_num = I2S_PIN_NO_CHANGE,
      .data_in_num = I2S_SD
  };

  esp_err_t ret = i2s_driver_install(I2S_PORT, &i2s_config, 0, NULL);
  if (ret != ESP_OK) return int(ret);

  ret = i2s_set_pin(I2S_PORT, &pin_config);
  if (ret != ESP_OK) return int(ret);

  ret = i2s_zero_dma_buffer(I2S_PORT);
  return int(ret);
}

static int ei_i2s_deinit(void) {
  i2s_driver_uninstall(I2S_PORT);
  i2sReady = false;
  return 0;
}

