Thesaru-p/AirTrixx/firmware/audio_dock_esp32s3/audio_dock_esp32s3.ino
static bool microphone_inference_start(uint32_t n_samples) {
  size_t inferenceBytes = n_samples * sizeof(int16_t);
  inference.buffer = (int16_t *)heap_caps_malloc(inferenceBytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
  if (inference.buffer == NULL) {
    inference.buffer = (int16_t *)heap_caps_malloc(inferenceBytes, MALLOC_CAP_8BIT);
  }
  if (inference.buffer == NULL) {
    return false;
  }

  inference.buf_count  = 0;
  inference.n_samples  = n_samples;
  inference.buf_ready  = 0;

  if (ei_i2s_init(EI_CLASSIFIER_FREQUENCY) != 0) {
    Serial.println("Failed to start I2S for Edge Impulse!");
    free(inference.buffer);
    inference.buffer = nullptr;
    return false;
  }

  delay(100);
  record_status = true;
  xTaskCreate(capture_samples, "CaptureSamples", 1024 * 32, (void*)sample_buffer_size, 10, NULL);
  return true;
}

static bool microphone_inference_record(void) {
  while (inference.buf_ready == 0) {
    delay(10);
  }
  inference.buf_ready = 0;
  return true;
}

static int microphone_audio_signal_get_data(size_t offset, size_t length, float *out_ptr) {
  numpy::int16_to_float(&inference.buffer[offset], out_ptr, length);
  return 0;
}

static void microphone_inference_end(void) {
  record_status = false;
  
  // Wait for the capture task to exit cleanly
  uint32_t timeout = millis() + 500;
  while (taskRunning && millis() < timeout) {
    delay(5);
  }
  delay(50); // Additional safety margin
  
  ei_i2s_deinit();
  if (inference.buffer != nullptr) {
    free(inference.buffer);
    inference.buffer = nullptr;
  }
}

// -------------------- ESP-NOW Handlers & Config --------------------
void configureWiFiChannel() {
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.disconnect();
  WiFi.setTxPower(WIFI_POWER_8_5dBm);
  esp_wifi_set_ps(WIFI_PS_NONE);
  esp_wifi_set_max_tx_power(WIFI_TX_POWER_QDBM);
  esp_wifi_set_promiscuous(true);
  esp_wifi_set_channel(ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
  esp_wifi_set_promiscuous(false);
  esp_wifi_config_80211_tx_rate(WIFI_IF_STA, WIFI_PHY_RATE_1M_L);
}

bool addEspNowPeer(const uint8_t mac[6]) {
  if (esp_now_is_peer_exist(mac)) {
    return true;
  }
  esp_now_peer_info_t peer = {};
  memcpy(peer.peer_addr, mac, 6);
  peer.channel = ESPNOW_CHANNEL;
  peer.encrypt = false;
  peer.ifidx = WIFI_IF_STA;
  return (esp_now_add_peer(&peer) == ESP_OK);
}

bool parseAntennaConnectionStatus(const String &incoming, uint8_t *mask) {
  if (!incoming.startsWith("__STATUS:")) {
    return false;
  }

  String maskText = incoming.substring(9);
  int marker = maskText.indexOf("__");
  if (marker >= 0) {
    maskText = maskText.substring(0, marker);
  }
  maskText.trim();
  if (maskText.length() == 0) {
    return false;
  }

  char *endPtr = nullptr;
  unsigned long value = strtoul(maskText.c_str(), &endPtr, 16);
  if (endPtr == maskText.c_str()) {
    return false;
  }

  *mask = static_cast<uint8_t>(value & 0xFF);
  return true;
}

void handleIncomingPacket(const uint8_t *data, int len) {
  if (len < static_cast<int>(sizeof(AirTrixxPacketHeader))) {
    return;
  }
  AirTrixxPacketHeader header = {};
  memcpy(&header, data, sizeof(header));
  if (header.protocol_version != AIRTRIXX_PROTOCOL_VERSION) {
    return;
  }

  if (header.msg_type == MSG_AUDIODOCK_TRANSCRIPT && len == static_cast<int>(sizeof(AudioDockTranscriptPacket))) {
    AudioDockTranscriptPacket packet = {};
    memcpy(&packet, data, sizeof(packet));

    String incoming = String(packet.transcript);
    incoming.trim();

    uint8_t connectionMask = 0;
    if (parseAntennaConnectionStatus(incoming, &connectionMask)) {
      antennaConnectionMask = connectionMask;
      hasAntennaConnectionMask = true;
      if (currentState == STATE_INIT || currentState == STATE_WAIT_CLAP) {
        ringShowConnectionMask(antennaConnectionMask);
        lastConnectionRingRefreshMs = millis();
      }
      return;
    }

    if (incoming == "__CMD:LEDTEST__") {
      if (lastRemoteCommandText == incoming && millis() - lastRemoteCommandMs < 1500) {
        return;
      }
      lastRemoteCommandText = incoming;
      lastRemoteCommandMs = millis();
      runLedRingSelfTest();
      displayLCDStatus("System Ready", "Clap to speak!");
      return;
    }
    if (incoming == "__CMD:SPEAKERTEST__") {
      if (lastRemoteCommandText == incoming && millis() - lastRemoteCommandMs < 1500) {
        return;
      }
      lastRemoteCommandText = incoming;
      lastRemoteCommandMs = millis();
      runSpeakerSelfTest();
      displayLCDStatus("System Ready", "Clap to speak!");
      return;
    }

    lastTranscriptText = incoming;
    transcriptReceived = true;
  }
}

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void onDataRecv(const esp_now_recv_info_t *info, const uint8_t *incomingData, int len) {
  (void)info;
  handleIncomingPacket(incomingData, len);
}
#else
void onDataRecv(const uint8_t *mac, const uint8_t *incomingData, int len) {
  (void)mac;
  handleIncomingPacket(incomingData, len);
}
#endif

bool sendEspNowToAntenna(const uint8_t *data, size_t len, uint8_t retries = 10) {
  esp_err_t result = ESP_FAIL;
  for (uint8_t attempt = 0; attempt <= retries; attempt++) {
    result = esp_now_send(ESPNOW_BROADCAST_MAC, data, len);
    if (result == ESP_OK) {
      return true;
    }
    delay(5);
  }
  Serial.printf("ESP-NOW send failed: %d\n", result);
  return false;
}

bool sendAudioDockHeartbeat() {
  HeartbeatPacket heartbeat = {};
  fillHeader(heartbeat.header,
             MSG_HEARTBEAT,
             DEVICE_AUDIODOCK,
             ++audioDockSequence,
             millis(),
             false);
  return sendEspNowToAntenna(reinterpret_cast<const uint8_t *>(&heartbeat), sizeof(heartbeat), 2);
}

void pumpAudioDockHeartbeat() {
  uint32_t nowMs = millis();
  if (nowMs - lastAudioDockHeartbeatMs < AUDIO_DOCK_HEARTBEAT_MS) {
    return;
  }
  lastAudioDockHeartbeatMs = nowMs;
  sendAudioDockHeartbeat();
}

bool sendAudioDockTrigger(uint8_t triggerType, uint32_t audioSize) {
  AudioDockDataPacket dataPacket = {};
  fillHeader(dataPacket.header,
             MSG_AUDIODOCK_DATA,
             DEVICE_AUDIODOCK,
             ++audioDockSequence,
             millis(),
             false);
  dataPacket.clap_detected = 1;
  dataPacket.clap_type = triggerType;
  dataPacket.audio_size = audioSize;

  return sendEspNowToAntenna(reinterpret_cast<const uint8_t *>(&dataPacket), sizeof(dataPacket), 20);
}

bool sendAudioDockChunk(const uint8_t *data, uint16_t len, uint32_t chunkIndex) {
  AudioDockChunkPacket chunkPacket = {};
  fillHeader(chunkPacket.header,
             MSG_AUDIODOCK_AUDIO_CHUNK,
             DEVICE_AUDIODOCK,
             ++audioDockSequence,
             millis(),
             false);
  chunkPacket.chunk_index = chunkIndex;
  chunkPacket.chunk_len = len > 200 ? 200 : len;
  memcpy(chunkPacket.data, data, chunkPacket.chunk_len);
  return sendEspNowToAntenna(reinterpret_cast<const uint8_t *>(&chunkPacket), sizeof(chunkPacket));
}

