Thesaru-p/AirTrixx/firmware/audio_dock_esp32s3/audio_dock_esp32s3.ino
bool recordAndStreamWavToAntenna(uint8_t triggerType, uint32_t *wavBytes) {
  if (!i2sReady) {
    lastRecordError = "I2S not ready";
    Serial.println("Cannot record: I2S mic is not ready.");
    return false;
  }

  lastRecordError = "";
  *wavBytes = AUDIO_TOTAL_BYTES;
  displayLCDStatus("Get ready", "Recording soon");
  ringFlash(0, 64, 0, 2, 120, 80);
  delay(SPEAK_DELAY_MS);

  if (!sendAudioDockTrigger(triggerType, AUDIO_TOTAL_BYTES)) {
    lastRecordError = "Trigger failed";
    return false;
  }
  delay(50);

  uint8_t wavHeader[WAV_HEADER_BYTES];
  writeWavHeader(wavHeader, AUDIO_DATA_BYTES);

  uint32_t chunkIndex = 0;
  if (!sendAudioDockChunk(wavHeader, WAV_HEADER_BYTES, chunkIndex++)) {
    lastRecordError = "Header failed";
    return false;
  }

  flushI2S();
  displayLCDStatus("Recording...", "Speak now!");
  Serial.printf("RECORD_STREAM_START seconds=%u bytes=%u\n",
                (unsigned int)RECORD_SECONDS,
                (unsigned int)AUDIO_TOTAL_BYTES);

  const uint32_t totalSamples = RECORD_SECONDS * SAMPLE_RATE;
  uint32_t samplesWritten = 0;
  uint32_t lastRingUpdate = 0;
  int32_t i2sBuffer[100];
  int16_t pcmBuffer[100];
  ringProgress(0, totalSamples, 80, 24, 0);

  while (samplesWritten < totalSamples) {
    uint32_t samplesToRead = totalSamples - samplesWritten;
    if (samplesToRead > 100) samplesToRead = 100;

    size_t bytesRead = 0;
    esp_err_t err = i2s_read(I2S_PORT,
                             i2sBuffer,
                             samplesToRead * sizeof(int32_t),
                             &bytesRead,
                             portMAX_DELAY);
    if (err != ESP_OK || bytesRead == 0) {
      lastRecordError = "I2S read failed";
      Serial.printf("I2S stream read failed: err=%d bytes=%u at_sample=%u\n",
                    err,
                    (unsigned int)bytesRead,
                    (unsigned int)samplesWritten);
      return false;
    }

    uint16_t samples = bytesRead / sizeof(int32_t);
    for (uint16_t i = 0; i < samples; i++) {
      int32_t sample16 = i2sBuffer[i] >> 16;
      int32_t boosted = sample16 * RECORD_GAIN;
      if (boosted > 32767) boosted = 32767;
      if (boosted < -32768) boosted = -32768;
      pcmBuffer[i] = (int16_t)boosted;
    }

    if (!sendAudioDockChunk(reinterpret_cast<const uint8_t *>(pcmBuffer),
                            samples * sizeof(int16_t),
                            chunkIndex++)) {
      lastRecordError = "Chunk failed";
      return false;
    }

    samplesWritten += samples;
    if (millis() - lastRingUpdate >= 120 || samplesWritten >= totalSamples) {
      ringProgress(samplesWritten, totalSamples, 80, 24, 0);
      lastRingUpdate = millis();
    }
  }

  Serial.printf("RECORD_STREAM_DONE wav_bytes=%u chunks=%u\n",
                (unsigned int)AUDIO_TOTAL_BYTES,
                (unsigned int)chunkIndex);
  return true;
}

bool streamWavFileToAntenna(uint8_t triggerType, uint32_t wavBytes) {
  if (!sdReady && !initSDCard()) {
    lastRecordError = "SD not ready";
    return false;
  }

  File file = SD.open(AUDIO_WAV_PATH, FILE_READ);
  if (!file) {
    lastRecordError = "SD read failed";
    Serial.println("Failed to open SD WAV file for reading.");
    return false;
  }

  if (wavBytes == 0) {
    wavBytes = file.size();
  }

  displayLCDStatus("Status: Sending", "Uploading...");
  if (!sendAudioDockTrigger(triggerType, wavBytes)) {
    lastRecordError = "Trigger failed";
    file.close();
    return false;
  }
  delay(50);

  Serial.printf("SD_STREAM_START bytes=%u path=%s\n",
                (unsigned int)wavBytes,
                AUDIO_WAV_PATH);

  uint8_t chunk[200];
  uint32_t sentBytes = 0;
  uint32_t chunkIndex = 0;
  uint32_t lastRingUpdate = 0;
  ringProgress(0, wavBytes, 0, 48, 64);

  while (sentBytes < wavBytes && file.available()) {
    uint32_t remaining = wavBytes - sentBytes;
    uint16_t want = remaining > sizeof(chunk) ? sizeof(chunk) : remaining;
    int bytesRead = file.read(chunk, want);
    if (bytesRead <= 0) {
      lastRecordError = "SD read failed";
      file.close();
      return false;
    }

    if (!sendAudioDockChunk(chunk, (uint16_t)bytesRead, chunkIndex++)) {
      lastRecordError = "Chunk failed";
      file.close();
      return false;
    }

    sentBytes += (uint32_t)bytesRead;
    if (millis() - lastRingUpdate >= 120 || sentBytes >= wavBytes) {
      ringProgress(sentBytes, wavBytes, 0, 48, 64);
      lastRingUpdate = millis();
    }

    delay(20);
  }

  file.close();
  Serial.printf("SD_STREAM_DONE sent=%u chunks=%u\n",
                (unsigned int)sentBytes,
                (unsigned int)chunkIndex);
  return sentBytes >= wavBytes;
}

void handleLocalSerialCommand(String command) {
  command.trim();
  command.toUpperCase();

  if (command == "LEDTEST" || command == "L") {
    runLedRingSelfTest();
  } else if (command == "SPEAKERTEST" || command == "SPKTEST" || command == "S") {
    runSpeakerSelfTest();
  } else if (command == "HELP" || command == "H") {
    Serial.println("Audio Dock commands: LEDTEST, SPEAKERTEST");
  } else if (command.length() > 0) {
    Serial.print("Unknown command: ");
    Serial.println(command);
    Serial.println("Use LEDTEST or SPEAKERTEST.");
  }
}

void pollLocalSerialCommands() {
  if (!Serial.available()) {
    return;
  }
  String command = Serial.readStringUntil('\n');
  handleLocalSerialCommand(command);
}

// -------------------- Main Arduino Setup & Loop --------------------
void setup() {
  Serial.begin(115200);
  delay(500);

  ledRing.begin();
  ledRing.setBrightness(LED_RING_BRIGHTNESS);
  ringClear();
  ringShowReady();
  disableOnboardLed();

  // Initialize LCD Screen
  Wire.begin(I2C_SDA, I2C_SCL);
  lcd.init();
  lcd.backlight();
  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print("AirTrixx Audio");
  lcd.setCursor(0, 1);
  lcd.print("Dock Booting...");
  delay(1000);

  if (!initSDCard()) {
    displayLCDStatus("SD Card Error", "Check wiring");
    ringShowError();
    delay(2000);
  }

  // Configure Wi-Fi STA and ESP-NOW
  configureWiFiChannel();

  // Read and display MAC address
  uint8_t mac[6] = {};
  WiFi.macAddress(mac);
  char macStr[18];
  snprintf(macStr, sizeof(macStr), "%02X:%02X:%02X:%02X:%02X:%02X",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  Serial.print("AUDIO_DOCK_MAC: ");
  Serial.println(macStr);

  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print("MAC Address:");
  lcd.setCursor(0, 1);
  lcd.print(macStr);
  delay(4000); // Display for 4 seconds so the user can easily see it!

