Thesaru-p/AirTrixx/firmware/audio_dock_esp32s3/audio_dock_esp32s3.ino
  if (esp_now_init() != ESP_OK) {
    displayLCDStatus("WiFi Error", "ESP-NOW Failed");
    while (1) { delay(1000); }
  }
  esp_now_register_recv_cb(onDataRecv);
  
  // Register PC Antenna peer
  addEspNowPeer(ANTENNA_MAC_PLACEHOLDER);
  addEspNowPeer(ESPNOW_BROADCAST_MAC);

  displayLCDStatus("System Ready", "Clap to speak!");
  currentState = STATE_WAIT_CLAP;
}

void loop() {
  pollLocalSerialCommands();
  pumpAudioDockHeartbeat();

  switch (currentState) {
    case STATE_WAIT_CLAP: {
      uint8_t mac[6] = {};
      WiFi.macAddress(mac);
      char macLcd[18];
      snprintf(macLcd, sizeof(macLcd), "MAC:%02X%02X%02X%02X%02X%02X",
               mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
      displayLCDStatus("Clap to speak!", macLcd);
      ringShowReady();
      
      if (!microphone_inference_start(EI_CLASSIFIER_RAW_SAMPLE_COUNT)) {
        displayLCDStatus("Inference Err", "Memory failed");
        ringShowError();
        delay(3000);
        break;
      }

      bool clapDetected = false;
      uint8_t triggerType = 0; // 1 = Single, 2 = Double
      uint16_t listeningStep = 0;

      while (!clapDetected) {
        pollLocalSerialCommands();
        pumpAudioDockHeartbeat();
        if (millis() - lastConnectionRingRefreshMs >= AUDIO_DOCK_RING_REFRESH_MS) {
          if (hasAntennaConnectionMask) {
            ringShowConnectionMask(antennaConnectionMask);
          } else {
            ringChase(0, 0, 80, listeningStep++);
          }
          lastConnectionRingRefreshMs = millis();
        }

        bool m = microphone_inference_record();
        if (!m) {
          continue;
        }

        signal_t signal;
        signal.total_length = EI_CLASSIFIER_RAW_SAMPLE_COUNT;
        signal.get_data = &microphone_audio_signal_get_data;
        ei_impulse_result_t result = { 0 };

        EI_IMPULSE_ERROR r = run_classifier(&signal, &result, debug_nn);
        if (r != EI_IMPULSE_OK) {
          continue;
        }

        float singleClapScore = 0.0f;
        float doubleClapScore = 0.0f;
        float noiseScore = 0.0f;
        float bestScore = -1.0f;
        String bestLabel = "";

        if (PRINT_CLAP_SCORES) {
          Serial.print("CLAP_SCORES");
        }

        for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT; ix++) {
          String label = String(result.classification[ix].label);
          float val = result.classification[ix].value;

          if (PRINT_CLAP_SCORES) {
            Serial.printf(" %s=%.2f", label.c_str(), val);
          }

          if (val > bestScore) {
            bestScore = val;
            bestLabel = label;
          }

          if (label.equalsIgnoreCase("Single clap")) {
            singleClapScore = val;
          } else if (label.equalsIgnoreCase("Double clap")) {
            doubleClapScore = val;
          } else if (label.equalsIgnoreCase("Noice") || label.equalsIgnoreCase("Noise")) {
            noiseScore = val;
          } else if (val > noiseScore) {
            noiseScore = val;
          }
        }

        float combinedClapScore = singleClapScore + doubleClapScore;
        float strongestClapScore = doubleClapScore > singleClapScore ? doubleClapScore : singleClapScore;
        bool strongSingleOrDouble = strongestClapScore >= CLAP_LABEL_THRESHOLD;
        bool combinedClapWins = combinedClapScore >= CLAP_COMBINED_THRESHOLD;
        bool clapClearsNoiseGate = CLAP_NOISE_MARGIN <= 0.0f || combinedClapScore >= (noiseScore + CLAP_NOISE_MARGIN);
        bool acceptClap = clapClearsNoiseGate && (strongSingleOrDouble || combinedClapWins);

        if (PRINT_CLAP_SCORES) {
          uint32_t peak = lastInferencePeak;
          Serial.printf(" combined=%.2f best=%s %.2f peak=%lu accept=%u\n",
                        combinedClapScore,
                        bestLabel.c_str(),
                        bestScore,
                        (unsigned long)peak,
                        acceptClap ? 1 : 0);
        }

        if (acceptClap) {
          triggerType = doubleClapScore > singleClapScore ? 2 : 1;
          const char *triggerLabel = triggerType == 2 ? "Double clap" : "Single clap";
          float triggerScore = triggerType == 2 ? doubleClapScore : singleClapScore;
          Serial.printf("Triggered! Detected: %s score=%.2f combined=%.2f noise=%.2f\n",
                        triggerLabel,
                        triggerScore,
                        combinedClapScore,
                        noiseScore);
          clapDetected = true;
        }
      }

      // Clap detected! Stop model classification
      microphone_inference_end();
      displayLCDStatus("Clap Detected!", "Speak now...");
      ringFlash(0, 64, 0, 2, 120, 80);
      delay(250);

      pendingTriggerType = triggerType;
      currentState = STATE_RECORDING;
      break;
    }

    case STATE_RECORDING: {
      displayLCDStatus("Record+Send", "Listening...");
      
      if (!initI2SMic()) {
        displayLCDStatus("Mic Error", "Failed to start");
        ringShowError();
        delay(2000);
        currentState = STATE_WAIT_CLAP;
        break;
      }

      uint32_t wavSize = 0;
      bool recordedOk = recordWavToSD(&wavSize);
      
      // Uninstall microphone I2S driver
      i2s_driver_uninstall(I2S_PORT);
      i2sReady = false;

      if (!recordedOk) {
        String errorLine = lastRecordError.length() > 0 ? lastRecordError : "Failed saving";
        displayLCDStatus("Record Error", errorLine.substring(0, 16));
        ringShowError();
        delay(2000);
        currentState = STATE_WAIT_CLAP;
        break;
      }

      recordedWavBytes = wavSize;
      currentState = STATE_STREAMING;
      break;
    }

    case STATE_STREAMING: {
      bool streamedOk = streamWavFileToAntenna(pendingTriggerType, recordedWavBytes);
      if (!streamedOk) {
        String errorLine = lastRecordError.length() > 0 ? lastRecordError : "Send failed";
        displayLCDStatus("Send Error", errorLine.substring(0, 16));
        ringShowError();
        delay(2000);
        currentState = STATE_WAIT_CLAP;
        break;
      }

      transcriptReceived = false;
      transcriptWaitStartMs = millis();
      currentState = STATE_WAIT_TRANSCRIPT;
      break;
    }

    case STATE_WAIT_TRANSCRIPT: {
      displayLCDStatus("Status: Wait...", "Transcribing...");
      uint16_t waitStep = 0;
      uint32_t lastRingUpdate = 0;
      
      while (!transcriptReceived && (millis() - transcriptWaitStartMs < TRANSCRIPT_TIMEOUT_MS)) {
        pollLocalSerialCommands();
        pumpAudioDockHeartbeat();
        if (millis() - lastRingUpdate >= 100) {
          ringChase(64, 0, 80, waitStep++);
          lastRingUpdate = millis();
        }
        delay(50);
      }

      if (transcriptReceived) {
        displayLCDTranscript(lastTranscriptText);
        ringShowSuccess();
        playTranscriptionDoneSound();
        delay(5000); // Display the transcript for 5 seconds
      } else {
        displayLCDStatus("Status: Timeout", "No response");
        ringShowError();
        delay(3000);
      }

      ringShowReady();
      currentState = STATE_WAIT_CLAP;
      break;
    }
  }
}
